app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
  	@latest_posts = Post.all