app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "best"], ["created_at", Wed, 13 Mar 2013 22:21:35 UTC +00:00], ["name", "primero"], ["title", "hahaha"], ["updated_at", Wed, 13 Mar 2013 22:21:35 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "posts" SET "photo_file_name" = 'PIC1.PNG', "photo_content_type" = 'image/png', "photo_file_size" = 2099931, "photo_updated_at" = '2013-04-25 05:26:53.927497', "updated_at" = '2013-04-25 05:26:53.972500' WHERE "posts"."id" = 4